#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//int main()
//{
//	//算数操作符 + - * / %
//	// / - 整型的除法    1/2 --> 0
//	// / - 浮点型的除法  1.0/2 --> 0.5 两端至少有一个是浮点数
//	
//	// % - 计算的是整除之后的余数
//	// %的两端必须是整数
//	int a = 7 % 2;
//	int b = 7 / 2;
//	printf("%d\n", a);
//	printf("%d\n", b);
//}





//正整数的原码、反码、补码相同
//7
//00000000000000000000000000000111 - 原码
//00000000000000000000000000000111 - 反码
//00000000000000000000000000000111 - 补码

//负整数的原码、补码、反码是要通过计算的
//-7
//10000000000000000000000000000111 - 原码
//11111111111111111111111111111000 - 反码 原码符号位不变，其它位按位取反
//11111111111111111111111111111001 - 补码 反码+1

//C语言中存储的都是反码

int main()
{
	//移位操作符 <<  >>
	//<< - 左移操作符
	//>> - 右移操作符
	//正整数移位
	int a = 7;	//0111
	int b = a << 1; //a向左移动一位 1110
	int c = a >> 1;
	printf("a = %d\n", a);
	printf("b = %d\n", b);
	printf("c = %d\n", c);
	//负整数移位
	int d = -7;
	int e = d << 1;//a的补码11111111111111111111111111111001 -> a的反码11111111111111111111111111110010 -> 
	int f = d >> 1;
	printf("d = %d\n", d);
	printf("e = %d\n", e);
	printf("f = %d\n", f);
	return 0;
}